<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads OpenJDK12 and builds a package, then uploads to the JSS.</string>
    <key>Identifier</key>
    <string>ch.midni9ht.jss-upload.OpenJDK12</string>
    <key>Input</key>
    <dict>
        <key>CATEGORY</key>
        <string>Developer</string>
        <key>NAME</key>
        <string>OpenJDK12</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rtrouton.pkg.OpenJDK12</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>category</key>
                <string>%CATEGORY%</string>
                <key>prod_name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>JSSImporter</string>
        </dict>
    </array>
</dict>
</plist>
