<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
   <key>Comment</key>
	 <string>Created with Recipe Robot v1.2.1 (https://github.com/homebysix/recipe-robot)</string>
	 <key>Description</key>
	 <string>Downloads the latest version of Balsamiq Wireframes.</string>
	 <key>Identifier</key>
	 <string>ch.midni9ht.download.BalsamiqWireframes</string>
   <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Balsamiq Wireframes</string>
      <key>SEARCH_URL</key>
      <string>https://builds.balsamiq.com/</string>
     <key>SEARCH_PATTERN</key>
     <string>bwd/Balsamiq Wireframes 4.*.*.dmg</string>
     <key>DOWNLOAD_URL</key>
     <string>https://builds.balsamiq.com/bwd/</string>
     <key>NAME</key>
     <string>Balsamiq Wireframes</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%Balsamiq Wireframes %version%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Balsamiq Wireframes.app</string>
				<key>requirement</key>
				<string>anchor apple generic and identifier "com.balsamiq.wireframes" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3DPKD72KQ7")</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/Balsamiq Wireframes.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
