<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Freeplane.</string>
		<key>Identifier</key>
		<string>ch.midni9ht.download.Freeplane</string>
		<key>Input</key>
		<dict>
			<key>DOWNLOAD_URL</key>
			<string>https://sourceforge.net/projects/freeplane/files/</string>
			<key>NAME</key>
			<string>Freeplane</string>
			<key>MAJOR_OS_VERSION</key>
			<string></string>
			<key>SEARCH_PATTERN</key>
			<string>href="(.*/projects/freeplane/files/freeplane%20stable/freeplane_app*\.dmg/download)"</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>SOURCEFORGE_FILE_PATTERN</key>
					<string>Freeplane-[\d.]*\.dmg</string>
					<key>SOURCEFORGE_PROJECT_ID</key>
					<integer>211069</integer>
				</dict>
				<key>Processor</key>
				<string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/Freeplane.app</string>
					<key>requirement</key>
					<string>identifier "org.freeplane.core" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = CSHVD99Y7K</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Freeplane.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
